app/controllers/family_controller.rb

  def show
      if !@family.notTaken && !params[:mine]
        redirect_to root_path
      end
      if params[:mine] == "true"
        @items = @family.items.isMine current_user.id
      else
        @items = @family.items.all.available
---
SELECT "items".* FROM "items" WHERE "items"."family_id" = ?  [["family_id", 3]]

  def set_family
      @family = Family.find(params[:id])
---
SELECT  "families".* FROM "families" WHERE "families"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def my_family
    @family = Family.find(params[:id])
    user = params[:user]
    if user == "undefined"
      user = current_user.id
    end
    user ||= current_user.id
    @items = @family.items.isMine user.to_i
    @user = User.find(user.to_i)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."family_id" = ?  [["family_id", 5]]

  def api
    Family.all.each do |f|
      f.update_attribute("lf",f.items.available.length)
      tot = 0
      f.items.available.each do |i|
        tot += i.totalCost
      end
      f.update_attribute("cost",tot)
    end
    if params[:mine] == "true"
      @families = Family.all.isMine current_user.id
    elsif params[:mode] == "price" and params[:cost] == "on"
      @families = Family.expensive.available
    elsif params[:mode] == "item"
      if params[:item] == "on"
        @families = Family.mostItems.available
      else
        @families = Family.leastItems.available
      end
    elsif params[:mode] == "admin"
        @families = Family.all.needs
    elsif params[:mode] == "donor"
        @families = Family.all.isMine params[:donor].to_i
    elsif params[:mode] == "recieved"
        @families = Family.all.isRecieved.select{ |f| !f.delivered }
---
SELECT "families".* FROM "families" ORDER BY left DESC
SELECT "items".* FROM "items" WHERE "items"."family_id" = ?  [["family_id", 1]]
SELECT "items".* FROM "items" WHERE ("items"."user_id" IS NOT NULL)
SELECT "items".* FROM "items" WHERE "items"."recieved" = ?  [["recieved", "t"]]