app/controllers/item_controller.rb

  def new
    @family = Family.find(params[:id])
---
SELECT  "families".* FROM "families" WHERE "families"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @family = Family.find(params[:family])
---
SELECT  "families".* FROM "families" WHERE "families"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def recieved
    @user = User.find(params[:donor])
    @family = Family.all.isMine @user.id
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "families".* FROM "families"

  def remove_status
    failed = false
    itemsRemoved = ""
    user = User.find(current_user.id)
    if user.message == nil
      user.update_attribute("message"," ");
    end
    Family.find(params[:family]).items.each do |i|
      if params[i.id.to_s] != nil
        itemsRemoved += i.name + ","
        i.update_attribute("recieved",false)
        current_user.items.delete(i)
      end
    end
    if !failed
      itemsRemoved.chomp
      family = Family.find(params[:family])
      familyCost = 0
      family.items.available.each do |i|
        familyCost += i.totalCost
      end
      family.update_attribute("cost",familyCost)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "families".* FROM "families" WHERE "families"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."family_id" = ?  [["family_id", 5]]
UPDATE "items" SET "user_id" = NULL WHERE "items"."user_id" = ? AND "items"."id" = 27  [["user_id", 1]]
UPDATE "families" SET "cost" = ?, "updated_at" = ? WHERE "families"."id" = ?  [["cost", 412.12], ["updated_at", "2017-11-03 03:28:59.766604"], ["id", 5]]

  def update_status
    failed = false
    user = User.find(current_user.id)
    if user.message == nil
      user.update_attribute("message"," ");
    end
    Family.find(params[:family]).items.each do |i|
      if params[i.id.to_s] != nil
        if i.user_id == nil
          current_user.items << i
          i.update_attribute("recieved",false)
          user.update_attribute("message",user.message + ", <h5>" + i.name + "</h5><p>Total Cost: "+ActiveSupport::NumberHelper.number_to_currency(i.totalCost) + "</p><p>Quantity: "+i.quantity.to_s + "</p><p>Unit Cost: "+ ActiveSupport::NumberHelper.number_to_currency(i.cost)+"</p><p>Family: "+Family.find(i.family_id).name+"</p> <p>Description: "+i.description+"</p>")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "contacted" = ? WHERE "users"."id" = ?  [["updated_at", "2017-11-03 03:28:52.554299"], ["contacted", "t"], ["id", 1]]
SELECT  "families".* FROM "families" WHERE "families"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."family_id" = ?  [["family_id", 5]]
UPDATE "families" SET "cost" = ?, "updated_at" = ? WHERE "families"."id" = ?  [["cost", 407.12], ["updated_at", "2017-11-03 03:28:49.958110"], ["id", 5]]
UPDATE "items" SET "updated_at" = ?, "recieved" = ? WHERE "items"."id" = ?  [["updated_at", "2017-11-04 01:50:48.399601"], ["recieved", "f"], ["id", 16]]