app/controllers/page_controller.rb

  def index
      @families = Family.cheapest.available
      if params[:mode] == "price" and params[:cost] == "on"
        @families = Family.expensive.available
      elsif params[:mode] == "item"
        if params[:item] == "on"
          @families = Family.mostItems.available
        else
          @families = Family.leastItems.available
        end
      end
      @items =  Item.all.available
---
SELECT "items".* FROM "items"

  def admin
      @items = Item.all.donated
      @recieved = Item.all.recieved
      @available = Item.all.available
      @donors = User.all.donor
---
SELECT "items".* FROM "items"
SELECT "items".* FROM "items" WHERE "items"."recieved" = ?  [["recieved", "t"]]
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"

  def contact
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def sendEmail
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def donor
    @donor = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]