app/controllers/user_controller.rb

  def show
    @familys = Family.all.isMine current_user.id
---
SELECT "families".* FROM "families"

  def verify
    if current_user != nil
      @user = current_user
    else
      @user = User.find(params[:id])
    end
    if params[:resend] == "t"
      @user.update_attribute("token",rand(36**15).to_s(36))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", "ag1dvjoz9j3dp2q"], ["updated_at", "2017-11-03 02:24:00.454124"], ["id", 1]]

  def checkToken
    @user = User.find(params[:id])
    if @user.token == params[:token]
      @user.update_attribute("email_verify",true)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email_verify" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email_verify", "t"], ["updated_at", "2017-11-03 02:27:43.981654"], ["id", 1]]